TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_wwdtlp0.h
/******************************************************************************
* WWDTLP0 Register Control Bits
******************************************************************************/

/* WWDTLP0_IIDX Bits */
/* WWDTLP0_IIDX[STAT] Bits */
#define WWDTLP0_IIDX_STAT_OFS                    (0)                             /* !< STAT Offset */
#define WWDTLP0_IIDX_STAT_MASK                   ((uint32_t)0x0000001FU)         /* !< Module Interrupt Vector Value.
                                                                                    This register provides the highest
                                                                                    priority interrupt index. A read
                                                                                    clears the corresponding interrupt
                                                                                    flag in RIS and MISC. */
#define WWDTLP0_IIDX_STAT_NO_INTR                ((uint32_t)0x00000000U)         /* !< No interrupt pending */
#define WWDTLP0_IIDX_STAT_INTTIM                 ((uint32_t)0x00000001U)         /* !< Interval Timer Interrupt; Interrupt
                                                                                    Flag: INTTIM; Interrupt Priority:
                                                                                    Highest */

/* WWDTLP0_IMASK Bits */
/* WWDTLP0_IMASK[INTTIM] Bits */
#define WWDTLP0_IMASK_INTTIM_OFS                 (0)                             /* !< INTTIM Offset */
#define WWDTLP0_IMASK_INTTIM_MASK                ((uint32_t)0x00000001U)         /* !< Interval Timer Interrupt. */
#define WWDTLP0_IMASK_INTTIM_CLR                 ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define WWDTLP0_IMASK_INTTIM_SET                 ((uint32_t)0x00000001U)         /* !< Set Interrupt Mask */

/* WWDTLP0_RIS Bits */
/* WWDTLP0_RIS[INTTIM] Bits */
#define WWDTLP0_RIS_INTTIM_OFS                   (0)                             /* !< INTTIM Offset */
#define WWDTLP0_RIS_INTTIM_MASK                  ((uint32_t)0x00000001U)         /* !< Interval Timer Interrupt. */
#define WWDTLP0_RIS_INTTIM_CLR                   ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define WWDTLP0_RIS_INTTIM_SET                   ((uint32_t)0x00000001U)         /* !< Interrupt occurred */

/* WWDTLP0_MIS Bits */
/* WWDTLP0_MIS[INTTIM] Bits */
#define WWDTLP0_MIS_INTTIM_OFS                   (0)                             /* !< INTTIM Offset */
#define WWDTLP0_MIS_INTTIM_MASK                  ((uint32_t)0x00000001U)         /* !< Interval Timer Interrupt. */
#define WWDTLP0_MIS_INTTIM_CLR                   ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define WWDTLP0_MIS_INTTIM_SET                   ((uint32_t)0x00000001U)         /* !< Interrupt occurred */

/* WWDTLP0_ISET Bits */
/* WWDTLP0_ISET[INTTIM] Bits */
#define WWDTLP0_ISET_INTTIM_OFS                  (0)                             /* !< INTTIM Offset */
#define WWDTLP0_ISET_INTTIM_MASK                 ((uint32_t)0x00000001U)         /* !< Interval Timer Interrupt. */
#define WWDTLP0_ISET_INTTIM_NO_EFFECT            ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define WWDTLP0_ISET_INTTIM_SET                  ((uint32_t)0x00000001U)         /* !< Set Interrupt */

/* WWDTLP0_ICLR Bits */
/* WWDTLP0_ICLR[INTTIM] Bits */
#define WWDTLP0_ICLR_INTTIM_OFS                  (0)                             /* !< INTTIM Offset */
#define WWDTLP0_ICLR_INTTIM_MASK                 ((uint32_t)0x00000001U)         /* !< Interval Timer Interrupt. */
#define WWDTLP0_ICLR_INTTIM_NO_EFFECT            ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define WWDTLP0_ICLR_INTTIM_CLR                  ((uint32_t)0x00000001U)         /* !< Clear Interrupt */

/* WWDTLP0_PWREN Bits */
/* WWDTLP0_PWREN[ENABLE] Bits */
#define WWDTLP0_PWREN_ENABLE_OFS                 (0)                             /* !< ENABLE Offset */
#define WWDTLP0_PWREN_ENABLE_MASK                ((uint32_t)0x00000001U)         /* !< Enable the power Note: For safety
                                                                                    devices the power cannot be disabled
                                                                                    once enabled. */
#define WWDTLP0_PWREN_ENABLE_DISABLE             ((uint32_t)0x00000000U)         /* !< Disable Power */
#define WWDTLP0_PWREN_ENABLE_ENABLE              ((uint32_t)0x00000001U)         /* !< Enable Power */
/* WWDTLP0_PWREN[KEY] Bits */
#define WWDTLP0_PWREN_KEY_OFS                    (24)                            /* !< KEY Offset */
#define WWDTLP0_PWREN_KEY_MASK                   ((uint32_t)0xFF000000U)         /* !< KEY to allow Power State Change */
#define WWDTLP0_PWREN_KEY_UNLOCK_W               ((uint32_t)0x26000000U)         /* !< KEY to allow write access to this
                                                                                    register */

/* WWDTLP0_RSTCTL Bits */
/* WWDTLP0_RSTCTL[RESETSTKYCLR] Bits */
#define WWDTLP0_RSTCTL_RESETSTKYCLR_OFS          (1)                             /* !< RESETSTKYCLR Offset */
#define WWDTLP0_RSTCTL_RESETSTKYCLR_MASK         ((uint32_t)0x00000002U)         /* !< Clear [GPRCM.STAT.RESETSTKY] */
#define WWDTLP0_RSTCTL_RESETSTKYCLR_NOP          ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define WWDTLP0_RSTCTL_RESETSTKYCLR_CLR          ((uint32_t)0x00000002U)         /* !< Clear reset sticky bit */
/* WWDTLP0_RSTCTL[RESETASSERT] Bits */
#define WWDTLP0_RSTCTL_RESETASSERT_OFS           (0)                             /* !< RESETASSERT Offset */
#define WWDTLP0_RSTCTL_RESETASSERT_MASK          ((uint32_t)0x00000001U)         /* !< Assert reset to the peripheral
                                                                                    Note: For safety devices a watchdog
                                                                                    reset by software is not possible. */
#define WWDTLP0_RSTCTL_RESETASSERT_NOP           ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define WWDTLP0_RSTCTL_RESETASSERT_ASSERT        ((uint32_t)0x00000001U)         /* !< Assert reset */
/* WWDTLP0_RSTCTL[KEY] Bits */
#define WWDTLP0_RSTCTL_KEY_OFS                   (24)                            /* !< KEY Offset */
#define WWDTLP0_RSTCTL_KEY_MASK                  ((uint32_t)0xFF000000U)         /* !< Unlock key */
#define WWDTLP0_RSTCTL_KEY_UNLOCK_W              ((uint32_t)0xB1000000U)         /* !< KEY to allow write access to this
                                                                                    register */

