TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_wwdtlp0.h
/* WWDTLP0_STAT Bits */
/* WWDTLP0_STAT[RESETSTKY] Bits */
#define WWDTLP0_STAT_RESETSTKY_OFS               (16)                            /* !< RESETSTKY Offset */
#define WWDTLP0_STAT_RESETSTKY_MASK              ((uint32_t)0x00010000U)         /* !< This bit indicates, if the
                                                                                    peripheral was reset, since this bit
                                                                                    was cleared by RESETSTKYCLR in the
                                                                                    RSTCTL register */
#define WWDTLP0_STAT_RESETSTKY_NORES             ((uint32_t)0x00000000U)         /* !< The peripheral has not been reset
                                                                                    since this bit was last cleared by
                                                                                    RESETSTKYCLR in the RSTCTL register */
#define WWDTLP0_STAT_RESETSTKY_RESET             ((uint32_t)0x00010000U)         /* !< The peripheral was reset since the
                                                                                    last bit clear */

/* WWDTLP0_CPU_CONNECT_0 Bits */

/* WWDTLP0_PDBGCTL Bits */
/* WWDTLP0_PDBGCTL[FREE] Bits */
#define WWDTLP0_PDBGCTL_FREE_OFS                 (0)                             /* !< FREE Offset */
#define WWDTLP0_PDBGCTL_FREE_MASK                ((uint32_t)0x00000001U)         /* !< Free run control */
#define WWDTLP0_PDBGCTL_FREE_STOP                ((uint32_t)0x00000000U)         /* !< The peripheral freezes
                                                                                    functionality while the Core Halted
                                                                                    input is asserted and resumes when it
                                                                                    is deasserted. */
#define WWDTLP0_PDBGCTL_FREE_RUN                 ((uint32_t)0x00000001U)         /* !< The peripheral ignores the state of
                                                                                    the Core Halted input */

/* WWDTLP0_EVT_MODE Bits */
/* WWDTLP0_EVT_MODE[INT0_CFG] Bits */
#define WWDTLP0_EVT_MODE_INT0_CFG_OFS            (0)                             /* !< INT0_CFG Offset */
#define WWDTLP0_EVT_MODE_INT0_CFG_MASK           ((uint32_t)0x00000003U)         /* !< Event line mode select for event
                                                                                    corresponding to [IPSTANDARD.CPU_INT] */
#define WWDTLP0_EVT_MODE_INT0_CFG_DISABLE        ((uint32_t)0x00000000U)         /* !< The interrupt or event line is
                                                                                    disabled. */
#define WWDTLP0_EVT_MODE_INT0_CFG_SOFTWARE       ((uint32_t)0x00000001U)         /* !< The interrupt or event line is in
                                                                                    software mode. Software must clear
                                                                                    the RIS. */
#define WWDTLP0_EVT_MODE_INT0_CFG_HARDWARE       ((uint32_t)0x00000002U)         /* !< The interrupt or event line is in
                                                                                    hardware mode. The hardware (another
                                                                                    module) clears automatically the
                                                                                    associated RIS flag. */

/* WWDTLP0_DESC Bits */
/* WWDTLP0_DESC[MINREV] Bits */
#define WWDTLP0_DESC_MINREV_OFS                  (0)                             /* !< MINREV Offset */
#define WWDTLP0_DESC_MINREV_MASK                 ((uint32_t)0x0000000FU)         /* !< Minor rev of the IP */
#define WWDTLP0_DESC_MINREV_MINIMUM              ((uint32_t)0x00000000U)         /* !< Smallest value */
#define WWDTLP0_DESC_MINREV_MAXIMUM              ((uint32_t)0x0000000FU)         /* !< Highest possible value */
/* WWDTLP0_DESC[MAJREV] Bits */
#define WWDTLP0_DESC_MAJREV_OFS                  (4)                             /* !< MAJREV Offset */
#define WWDTLP0_DESC_MAJREV_MASK                 ((uint32_t)0x000000F0U)         /* !< Major rev of the IP */
#define WWDTLP0_DESC_MAJREV_MINIMUM              ((uint32_t)0x00000000U)         /* !< Smallest value */
#define WWDTLP0_DESC_MAJREV_MAXIMUM              ((uint32_t)0x000000F0U)         /* !< Highest possible value */
/* WWDTLP0_DESC[INSTNUM] Bits */
#define WWDTLP0_DESC_INSTNUM_OFS                 (8)                             /* !< INSTNUM Offset */
#define WWDTLP0_DESC_INSTNUM_MASK                ((uint32_t)0x00000F00U)         /* !< Instance Number within the device.
                                                                                    This will be a parameter to the RTL
                                                                                    for modules that can have multiple
                                                                                    instances */
#define WWDTLP0_DESC_INSTNUM_MINIMUM             ((uint32_t)0x00000000U)         /* !< Smallest value */
#define WWDTLP0_DESC_INSTNUM_MAXIMUM             ((uint32_t)0x00000F00U)         /* !< Highest possible value */
/* WWDTLP0_DESC[FEATUREVER] Bits */
#define WWDTLP0_DESC_FEATUREVER_OFS              (12)                            /* !< FEATUREVER Offset */
#define WWDTLP0_DESC_FEATUREVER_MASK             ((uint32_t)0x0000F000U)         /* !< Feature Set for the module
                                                                                    *instance* */
#define WWDTLP0_DESC_FEATUREVER_MINIMUM          ((uint32_t)0x00000000U)         /* !< Smallest value */
#define WWDTLP0_DESC_FEATUREVER_MAXIMUM          ((uint32_t)0x0000F000U)         /* !< Highest possible value */
/* WWDTLP0_DESC[MODULEID] Bits */
#define WWDTLP0_DESC_MODULEID_OFS                (16)                            /* !< MODULEID Offset */
#define WWDTLP0_DESC_MODULEID_MASK               ((uint32_t)0xFFFF0000U)         /* !< Module identification contains a
                                                                                    unique peripheral identification
                                                                                    number. The assignments are
                                                                                    maintained in a central database for
                                                                                    all of the platform modules to ensure
                                                                                    uniqueness. */
#define WWDTLP0_DESC_MODULEID_MINIMUM            ((uint32_t)0x00000000U)         /* !< Smallest value */
#define WWDTLP0_DESC_MODULEID_MAXIMUM            ((uint32_t)0xFFFF0000U)         /* !< Highest possible value */

/* WWDTLP0_WWDTCTL0 Bits */
/* WWDTLP0_WWDTCTL0[PER] Bits */
#define WWDTLP0_WWDTCTL0_PER_OFS                 (4)                             /* !< PER Offset */
#define WWDTLP0_WWDTCTL0_PER_MASK                ((uint32_t)0x00000070U)         /* !< Timer Period of the WWDT. These
                                                                                    bits select the total watchdog timer
                                                                                    count. */
#define WWDTLP0_WWDTCTL0_PER_EN_25               ((uint32_t)0x00000000U)         /* !< Total timer count is 2^25 */
#define WWDTLP0_WWDTCTL0_PER_EN_21               ((uint32_t)0x00000010U)         /* !< Total timer count is 2^21 */
#define WWDTLP0_WWDTCTL0_PER_EN_18               ((uint32_t)0x00000020U)         /* !< Total timer count is 2^18 */
#define WWDTLP0_WWDTCTL0_PER_EN_15               ((uint32_t)0x00000030U)         /* !< Total timer count is 2^15 */
#define WWDTLP0_WWDTCTL0_PER_EN_12               ((uint32_t)0x00000040U)         /* !< Total timer count is 2^12 (default) */
#define WWDTLP0_WWDTCTL0_PER_EN_10               ((uint32_t)0x00000050U)         /* !< Total timer count is 2^10 */
#define WWDTLP0_WWDTCTL0_PER_EN_8                ((uint32_t)0x00000060U)         /* !< Total timer count is 2^8 */
#define WWDTLP0_WWDTCTL0_PER_EN_6                ((uint32_t)0x00000070U)         /* !< Total timer count is 2^6 */
/* WWDTLP0_WWDTCTL0[WINDOW0] Bits */
#define WWDTLP0_WWDTCTL0_WINDOW0_OFS             (8)                             /* !< WINDOW0 Offset */
#define WWDTLP0_WWDTCTL0_WINDOW0_MASK            ((uint32_t)0x00000700U)         /* !< Closed window period in percentage
                                                                                    of the timer interval.
                                                                                    WWDTCTL1.WINSEL determines the active
                                                                                    window setting (WWDTCTL0.WINDOW0 or
                                                                                    WWDTCTL0.WINDOW1). */
#define WWDTLP0_WWDTCTL0_WINDOW0_SIZE_0          ((uint32_t)0x00000000U)         /* !< 0% (No closed Window) */
#define WWDTLP0_WWDTCTL0_WINDOW0_SIZE_12         ((uint32_t)0x00000100U)         /* !< 12.50% of the total timer period is
                                                                                    closed window */
#define WWDTLP0_WWDTCTL0_WINDOW0_SIZE_18         ((uint32_t)0x00000200U)         /* !< 18.75% of the total timer period is
                                                                                    closed window */
#define WWDTLP0_WWDTCTL0_WINDOW0_SIZE_25         ((uint32_t)0x00000300U)         /* !< 25% of the total timer period is
                                                                                    closed window */
#define WWDTLP0_WWDTCTL0_WINDOW0_SIZE_50         ((uint32_t)0x00000400U)         /* !< 50% of the total timer period is
                                                                                    closed window */
#define WWDTLP0_WWDTCTL0_WINDOW0_SIZE_75         ((uint32_t)0x00000500U)         /* !< 75% of the total timer period is
                                                                                    closed window */
#define WWDTLP0_WWDTCTL0_WINDOW0_SIZE_81         ((uint32_t)0x00000600U)         /* !< 81.25% of the total timer period is
                                                                                    closed window */
#define WWDTLP0_WWDTCTL0_WINDOW0_SIZE_87         ((uint32_t)0x00000700U)         /* !< 87.50% of the total timer period is
                                                                                    closed window */
/* WWDTLP0_WWDTCTL0[MODE] Bits */
#define WWDTLP0_WWDTCTL0_MODE_OFS                (16)                            /* !< MODE Offset */
#define WWDTLP0_WWDTCTL0_MODE_MASK               ((uint32_t)0x00010000U)         /* !< Window Watchdog Timer Mode */
#define WWDTLP0_WWDTCTL0_MODE_WINDOW             ((uint32_t)0x00000000U)         /* !< Window Watchdog Timer Mode. The
                                                                                    WWDT will generate a error signal to
                                                                                    the ESM when following conditions
                                                                                    occur: - Timer Expiration (Timeout) -
                                                                                    Reset WWDT during the active window
                                                                                    closed period - Keyword violation */
#define WWDTLP0_WWDTCTL0_MODE_INTERVAL           ((uint32_t)0x00010000U)         /* !< Interval Timer Mode. The WWDT acts
                                                                                    as an interval timer. It generates an
                                                                                    interrupt on timeout. */
/* WWDTLP0_WWDTCTL0[STISM] Bits */
#define WWDTLP0_WWDTCTL0_STISM_OFS               (17)                            /* !< STISM Offset */
#define WWDTLP0_WWDTCTL0_STISM_MASK              ((uint32_t)0x00020000U)         /* !< Stop In Sleep Mode.    The
                                                                                    functionality of this bit requires
                                                                                    that POLICY.HWCEN = 0. If
                                                                                    POLICY.HWCEN = 1 the WWDT resets
                                                                                    during sleep and needs
                                                                                    re-configuration. Note: This bit has
                                                                                    no effect for the global Window
                                                                                    Watchdog as Sleep Mode is not
                                                                                    supported. */
#define WWDTLP0_WWDTCTL0_STISM_CONT              ((uint32_t)0x00000000U)         /* !< The WWDT continues to function in
                                                                                    Sleep mode. */
#define WWDTLP0_WWDTCTL0_STISM_STOP              ((uint32_t)0x00020000U)         /* !< The WWDT stops in Sleep mode and
                                                                                    resumes where it was stopped after
                                                                                    wakeup. */
/* WWDTLP0_WWDTCTL0[KEY] Bits */
#define WWDTLP0_WWDTCTL0_KEY_OFS                 (24)                            /* !< KEY Offset */
#define WWDTLP0_WWDTCTL0_KEY_MASK                ((uint32_t)0xFF000000U)         /* !< KEY to allow write access to this
                                                                                    register.  Writing to this register
                                                                                    with an incorrect key activates the
                                                                                    WWDT error signal to the ESM. Read as
                                                                                    0. */
#define WWDTLP0_WWDTCTL0_KEY_UNLOCK_W            ((uint32_t)0xC9000000U)         /* !< KEY to allow write access to this
                                                                                    register */
/* WWDTLP0_WWDTCTL0[CLKDIV] Bits */
#define WWDTLP0_WWDTCTL0_CLKDIV_OFS              (0)                             /* !< CLKDIV Offset */
#define WWDTLP0_WWDTCTL0_CLKDIV_MASK             ((uint32_t)0x00000007U)         /* !< Module Clock Divider, Divide the
                                                                                    clock source by CLKDIV+1. Divider
                                                                                    values from /1 to /8 are possible.
                                                                                    The clock divider is currently 4
                                                                                    bits. Bit 4 has no effect and should
                                                                                    always be written with 0. */
#define WWDTLP0_WWDTCTL0_CLKDIV_MINIMUM          ((uint32_t)0x00000000U)         /* !< Minimum value */
#define WWDTLP0_WWDTCTL0_CLKDIV_MAXIMUM          ((uint32_t)0x00000007U)         /* !< Maximum value */
/* WWDTLP0_WWDTCTL0[WINDOW1] Bits */
#define WWDTLP0_WWDTCTL0_WINDOW1_OFS             (12)                            /* !< WINDOW1 Offset */
#define WWDTLP0_WWDTCTL0_WINDOW1_MASK            ((uint32_t)0x00007000U)         /* !< Closed window period in percentage
                                                                                    of the timer interval.
                                                                                    WWDTCTL1.WINSEL determines the active
                                                                                    window setting (WWDTCTL0.WINDOW0 or
                                                                                    WWDTCTL0.WINDOW1). */
#define WWDTLP0_WWDTCTL0_WINDOW1_SIZE_0          ((uint32_t)0x00000000U)         /* !< 0% (No closed Window) */
#define WWDTLP0_WWDTCTL0_WINDOW1_SIZE_12         ((uint32_t)0x00001000U)         /* !< 12.50% of the total timer period is
                                                                                    closed window */
#define WWDTLP0_WWDTCTL0_WINDOW1_SIZE_18         ((uint32_t)0x00002000U)         /* !< 18.75% of the total timer period is
                                                                                    closed window */
#define WWDTLP0_WWDTCTL0_WINDOW1_SIZE_25         ((uint32_t)0x00003000U)         /* !< 25% of the total timer period is
                                                                                    closed window */
#define WWDTLP0_WWDTCTL0_WINDOW1_SIZE_50         ((uint32_t)0x00004000U)         /* !< 50% of the total timer period is
                                                                                    closed window */
#define WWDTLP0_WWDTCTL0_WINDOW1_SIZE_75         ((uint32_t)0x00005000U)         /* !< 75% of the total timer period is
                                                                                    closed window */
#define WWDTLP0_WWDTCTL0_WINDOW1_SIZE_81         ((uint32_t)0x00006000U)         /* !< 81.25% of the total timer period is
                                                                                    closed window */
#define WWDTLP0_WWDTCTL0_WINDOW1_SIZE_87         ((uint32_t)0x00007000U)         /* !< 87.50% of the total timer period is
                                                                                    closed window */

/* WWDTLP0_WWDTCTL1 Bits */
/* WWDTLP0_WWDTCTL1[KEY] Bits */
#define WWDTLP0_WWDTCTL1_KEY_OFS                 (24)                            /* !< KEY Offset */
#define WWDTLP0_WWDTCTL1_KEY_MASK                ((uint32_t)0xFF000000U)         /* !< KEY to allow write access to this
                                                                                    register.  Writing to this register
                                                                                    with an incorrect key activates the
                                                                                    WWDT error signal to the ESM. Read as
                                                                                    0. */
#define WWDTLP0_WWDTCTL1_KEY_UNLOCK_W            ((uint32_t)0xBE000000U)         /* !< KEY to allow write access to this
                                                                                    register */
/* WWDTLP0_WWDTCTL1[WINSEL] Bits */
#define WWDTLP0_WWDTCTL1_WINSEL_OFS              (0)                             /* !< WINSEL Offset */
#define WWDTLP0_WWDTCTL1_WINSEL_MASK             ((uint32_t)0x00000001U)         /* !< Close Window Select */
#define WWDTLP0_WWDTCTL1_WINSEL_WIN0             ((uint32_t)0x00000000U)         /* !< In window mode field WINDOW0 of
                                                                                    WDDTCTL0 defines the closed window
                                                                                    size. */
#define WWDTLP0_WWDTCTL1_WINSEL_WIN1             ((uint32_t)0x00000001U)         /* !< In window mode field WINDOW1 of
                                                                                    WDDTCTL0 defines the closed window
                                                                                    size. */

/* WWDTLP0_WWDTCNTRST Bits */
/* WWDTLP0_WWDTCNTRST[RESTART] Bits */
#define WWDTLP0_WWDTCNTRST_RESTART_OFS           (0)                             /* !< RESTART Offset */
#define WWDTLP0_WWDTCNTRST_RESTART_MASK          ((uint32_t)0xFFFFFFFFU)         /* !< Window Watchdog Timer Counter
                                                                                    Restart Writing 00A7h to this
                                                                                    register restarts the WWDT Counter.
                                                                                    Writing any other value causes an
                                                                                    error generation to the ESM. Read as
                                                                                    0. */
#define WWDTLP0_WWDTCNTRST_RESTART_MINIMUM       ((uint32_t)0x00000000U)         /* !< Minimum value */
#define WWDTLP0_WWDTCNTRST_RESTART_MAXIMUM       ((uint32_t)0xFFFFFFFFU)         /* !< Maximum value */

/* WWDTLP0_WWDTSTAT Bits */
/* WWDTLP0_WWDTSTAT[RUN] Bits */
#define WWDTLP0_WWDTSTAT_RUN_OFS                 (0)                             /* !< RUN Offset */
#define WWDTLP0_WWDTSTAT_RUN_MASK                ((uint32_t)0x00000001U)         /* !< Watchdog running status flag. */
#define WWDTLP0_WWDTSTAT_RUN_OFF                 ((uint32_t)0x00000000U)         /* !< Watchdog counter stopped. */
#define WWDTLP0_WWDTSTAT_RUN_ON                  ((uint32_t)0x00000001U)         /* !< Watchdog running. */


#ifdef __cplusplus
}
#endif

#endif /* ti_devices_msp_peripherals_hw_wwdtlp0__include */

